// Задача 29: Напишите программу, 
//которая задаёт массив из 8 элементов и выводит их на экран.
// Например:
// 1, 2, 5, 7, 19, 6, 1, 33 -> [1, 2, 5, 7, 19, 6, 1, 33]


int[] array = {1,2,5,7,19,6,1,33};
int lgth = array.Length;

for(int i = 0; i < lgth; i++)
{
         
       
        Console.Write($" {array[i]}");
}
